openFoam/dlrCompressible/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}   
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (19.58 0 0);

boundaryField
{
    combustorInlet
    {
        type            decayingTurbulenceInflowGenerator;
        direction       1;
        LField          uniform 0.00275;
        RField          uniform (0.066922 0 0 0.063295 0 0.062786);
        refField        nonuniform List<vector>
        1600
        (
            (18.92893472 3.60554667 8.580577139)
            (19.02715828 3.478919225 8.664943658)
            (19.10095568 3.29459559 8.742460801)
            (19.15021311 3.052859983 8.813009044)
            (19.17485463 2.754085142 8.876479606)
            (19.17485029 2.397449429 8.950737607)
            (19.15021701 1.980800303 9.07352441)
            (19.10095862 1.510230514 9.168302511)
...
        );
        value           nonuniform List<vector>
        1600
        (
            (18.92893472 3.60554667 8.580577139)
            (19.02715828 3.478919225 8.664943658)
            (19.10095568 3.29459559 8.742460801)
            (19.15021311 3.052859983 8.813009044)
            (19.17485463 2.754085142 8.876479606)
            (19.17485029 2.397449429 8.950737607)
            (19.15021701 1.980800303 9.07352441)
            (19.10095862 1.510230514 9.168302511)
...
        );
    }

    combustorOutlet
    {
	type 		pressureInletOutletVelocity;
	value 		uniform (0 0 0);
    }

    combustorWall
    {
        type            noSlip;
    }

    combustorFrontWall
    {
        type            noSlip;
    }

    combustorExitWall
    {
        type            noSlip;
    }

    constrictionChannel
    {
        type            noSlip;
    }
}

// ************************************************************************* //
